Repository: kicsyromy/spring-player
Catalog: po/extra/*.po
Languages: es, ja, pl, ru

source: The editor that works
es: El editor que funciona
ja: 便利なテキストエディター
pl: Edytor, który działa
ru: Текстовый редактор, который работает

source: Code is the editor that works for you. It auto-saves your files, meaning they're always up-to-date. Plus it remembers your tabs so you never lose your spot, even in between sessions.
es: Código es el editor de texto que hace el trabajo por ti. Guarda automáticamente tus archivos, de modo que siempre estarán actualizados. Además, recuerda las pestañas abierta para que no pierdas el hilo, incluso entre sesiones.
ja: Code はあなたの役に立つテキストエディターです。編集中のファイルを自動保存し、常に最新の状態になるようにします。さらに、セッション中でも編集中の場所を見失わないようにタブを記録します。
pl: Kod jest edytorem, który pracuje dla Ciebie. Automatycznie zapisuje Twoje pliki, co oznacza, że zawsze jesteś na bieżąco. Dodatkowo zapamiętuje Twoje zakładki, więc nigdy nie tracisz miejsca, w którym skończyłeś, nawet pomiędzy sesjami.
ru: Code — это текстовый редактор, который работает на вас. Он автоматически сохраняет ваши файлы, а также запоминает открытые вкладки. Вы никогда не потеряете место, на котором остановились, даже в перерывах между сессиями.

source: Make it yours. Code is written from the ground up to be extensible. Keep things super lightweight and simple, or install extensions to turn Code into a full-blown IDE; it's your choice. And with a handful of useful preferences, you can tweak the behavior and interface to your liking.
es: Personalízalo. Código fue diseñado para ser extensible. Mantenlo ligero y sencillo o instala extensiones para convertir Código en un entorno de desarrollo adecuado a tus necesidades. Con un puñado de preferencias útiles ya incluidas, puedes personalizar el comportamiento y la interfaz a tu gusto. ¡Tú decides!
ja: あなたのものにする。Code は最大限に拡張可能であれという方針から書かれています。超軽量でシンプルなままを保つか、Code を本格的な開発環境へと変化させるか、それはあなた次第です。そしてひとつかみの便利な設定により、あなたの好みに応じて動作やインターフェースを微調整できます。
pl: Dostosuj go pod swoje potrzeby. Kod jest napisany od początku tak, aby dało się go rozszerzać. Utrzymaj lekkość i prostotę lub zainstaluj rozszerzenia, aby zmienić Kod w pełnowartościowe IDE - to Twój wybór. Dodatkowo z garścią użytecznych opcji możesz dostosować zachowanie i interfejs do swoich upodobań.
ru: Сделайте его своим. Code написан с нуля, чтобы быть расширяемым. Оставьте его легковесным и простым или установите расширения, чтобы превратить Code в полномасштабный IDE, выбор за вами. А с горсткой полезных настроек вы сможете изменить поведение и интерфейс по своему вкусу.

source: It's elementary. Code is made to be the perfect editor for elementary, meaning it closely follows the high standards of design, speed, and consistency. It's sexy, but not distracting.
es: Es elemental. Código fue hecho para ser el editor de texto perfecto para elementary, lo que significa que sigue los elevados estándares de diseño, velocidad y consistencia. Es atractivo, pero no te distrae.
ja: Code は elementary 用の完璧なテキストエディターとして作られているため、高水準のデザイン、スピード、そして一貫性を持ちます。とても美しいですが、気をそらすわけではありません。
pl: To elementarne. Kod jest stworzony, aby być doskonałym edytorem dla systemu elementary, a to znaczy, że ściśle trzyma się wysokich standardów zaprojektowania, szybkości i spójności. Jest sexy, ale nie rozprasza.
ru: Это elementary. Code сделан, чтобы быть идеальным текстовым редактором для elementary, что означает следование высоким стандартам дизайна, скорость и последовательность. Это привлекательно, но не отвлекающе.

source: Works with your language. Whether you're crafting code in Vala, scripting with PHP, or marking things up in HTML, Code has you covered. Experience full syntax highlighting with nearly all programming, scripting, and markup languages.
es: Funciona con el lenguaje de programación que elijas. Ya sea que estés generando código con Vala, scripts de PHP o editando etiquetas HTML, Código se encarga de ayudarte. Experimenta el resaltado de sintaxis en casi todos los lenguajes de programación, scripting y lenguajes de marcado.
ja: お使いの言語で動作します。Vala でコードをクラフトしていても、PHP でスクリプティングしていても、HTML で何かを作り出していても、Code はあなたをカバーします。ほぼすべてのプログラミング、スクリプティング、マークアップ言語で最大限の構文の強調を体験しましょう。
pl: Działa w Twoim języku. Czy piszesz kod w języku Vala, skrypt PHP, czy markery w HTML-u, Kod Ci w tym pomoże. Doświadcz pełnego kolorowania składni w prawie wszystkich językach programowania, skryptowych i markupowych.
ru: Работайте со своим языком. Строите ли вы код на Vala, пишите скрипты на PHP или делаете вещи на HTML, Scratch прикроет вас. Полная подсветка синтаксиса почти всех языков программирования, скриптинга и разметки.

source: Other syntax-highlighted languages: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
es: Otros lenguajes con resaltado de sintaxis: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
ja: そのほかのシンタックスハイライトの使用が可能な言語: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
pl: Inne języki z kolorowanie składni: Bash, C, C#, Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, MakeFile, Objective C, Pascal, Perl, Python, Ruby, XML.
ru: Другие поддерживаемые языки: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.

source: Additional features include:
es: Otras características incluidas:
ja: その他の機能:
pl: Dodatkowe funkcje obejmują:
ru: Дополнительные возможности включают:

source: syntax highlighting with gtksourceview-3
es: resaltado de sintaxis con gtksourceview-3
ja: gtksourceview-3 によるシンタックスハイライト
pl: podświetlanie składni z gtksourceview-3
ru: подсветка синтаксиса с gtksourceview-3

source: a find bar to search the words in the files
es: una barra para buscar palabras dentro de archivos
ja: ファイル内で単語を探すための検索バー
pl: pasek wyszukiwania do odnajdywania słów w plikach
ru: поиск по словам в документах

source: tab and split documents system
es: sistema para tabular y separar documentos
ja: タブおよび分割ドキュメントシステム
pl: karty oraz dzielony ekran dokumentów
ru: вкладки и режим разделения окна пополам

source: lots of others
es: muchas otras
ja: 他の多く
pl: wiele innych
ru: и многое другое

source: Edit code files
es: Edite archivos de código
ja: コードファイルを編集します
pl: Modyfikuje pliki z kodem
ru: Редактирование файлов с кодом

source: Code Editor
es: Editor de código
ja: コードエディター
pl: Edytor Kod
ru: Редактор кода

source: IDE;scratch;
es: IDE;código;

source: New Document
es: Nuevo documento
ja: 新しいドキュメント
pl: Nowy dokument
ru: Новый документ

source: New Window
es: Nueva Ventana
ja: 新しいウィンドウ
pl: Nowe okno
ru: Новое окно

source: Code
pl: Kod
